In [1]:
import pandas as pd
df = pd.read_excel('../z20_data/score.xlsx',index_col='지원번호')
df

       이름   학교    키   국어   영어   수학  과학  사회        SW특기  학년
지원번호
1번    강나래  구로고  197   90   85  100  95  85      Python   3
2번    강태원  구로고  184   40   35   50  55  25        Java   3
3번    강호림  구로고  168   80   75   70  80  75  javascript   2
4번    김수찬  구로고  187   40   60   70  75  80         NaN   1
5번    김재욱  구로고  188   15   20   10  35  10         NaN   1
6번    박동현  단지고  202   80  100   95  85  80           C   3
7번    박혜정  단지고  188   55   65   45  40  35      PYTHON   2
8번    승근열  단지고  190  100   85   90  95  95          c#   2

In [6]:
df['영어']

지원번호
1번     85
2번     35
3번     75
4번     60
5번     20
6번    100
7번     65
8번     85
Name: 영어, dtype: int64

In [4]:
# 컬럼에서 최소값을 출력
df['영어'].min()

20

In [3]:
# 선택한 컬럼의 최소값 index
df['영어'].idxmin()

'5번'

In [7]:
df.loc['5번']

이름      김재욱
학교      구로고
키       188
국어       15
영어       20
수학       10
과학       35
사회       10
SW특기    NaN
학년        1
Name: 5번, dtype: object

In [8]:
df['영어'].max()

100

In [9]:
df['영어'].idxmax()

'6번'

In [10]:
# index값의 행 전체(loc)
df.loc[df['영어'].idxmax()]

이름      박동현
학교      단지고
키       202
국어       80
영어      100
수학       95
과학       85
사회       80
SW특기      C
학년        3
Name: 6번, dtype: object

In [12]:
# 3학년 학생을 검색 하여 테이블로
df_3 = df[df['학년']==3]
df_3

       이름   학교    키  국어   영어   수학  과학  사회    SW특기  학년
지원번호
1번    강나래  구로고  197  90   85  100  95  85  Python   3
2번    강태원  구로고  184  40   35   50  55  25    Java   3
6번    박동현  단지고  202  80  100   95  85  80       C   3

In [13]:
# 3학년 테이블 중 원하는컬럼(영어)의 최소값의 인덱스를 리턴받아 검색 -> 행 전체의 데이터 출력
df_3.loc[df_3['영어'].idxmin()]

이름       강태원
학교       구로고
키        184
국어        40
영어        35
수학        50
과학        55
사회        25
SW특기    Java
학년         3
Name: 2번, dtype: object

In [14]:
# loc 없이 조건문으로
df_3[df_3['영어'] == df_3['영어'].min()]

       이름   학교    키  국어  영어  수학  과학  사회  SW특기  학년
지원번호
2번    강태원  구로고  184  40  35  50  55  25  Java   3